#version: 0.2
u t
o n
" :</w>
i n
on v
o p
p ut
a n
" ,</w>
e s
z e
t i
C onv
e a
r es
u an
uan ti
uanti ze
ut put
e ":</w>
op s
in ea
inea r
uantize L
uantizeL inear
D e
o r
e n
0 _
/ ops
utput _
d _
q uantizeLinear
De quantizeLinear
b l
/ Conv
bl k
a i
res blk
p _
_ t
o utput_
p e":</w>
t _
/ c
" (
v ai
vai p_
output_ 0_
a l
] ,</w>
s t
y pe":</w>
) ",</w>
_ output_0_
a m
_ O
{ "
} ,</w>
i g
/ops /ops
/ops/ops .
p o
o ut
DequantizeLinear _O
s e
s or
sor _
out _t
out_t en
out_ten sor_
" out_tensor_
_ 1
a t
x :
x: :
on n
onn x::
po in
poin t
_ point
0 ,</w>
" op
on d_
/c onv
e t_
in put
s _
en c
" input
_t ype":</w>
"op _type":</w>
res n
resn et_
resnet_ enc
e l
n am
ond_ resblk
: 0_
b i
or m
/ resnet_enc
r o
Conv _
/Conv 2
Q uantizeLinear
el u
R elu
/resnet_enc /
/resnet_enc/ resblk
nam e":</w>
onnx:: Conv_
utput_ vaip_
DequantizeLinear_O utput_vaip_
r c
w e
we ig
weig h
s c
/c ond_resblk
ze ro
zero _point
sc al
1 /ops/ops.
0 /
e c
] },</w>
t ec
st an
N orm
s h
bi a
" },</w>
"input ":</w>
" ]},</w>
tec t
tect or
De tector
ig _
ig_ resblk
al ig_resblk
[ "
u se
2 /
DequantizeLinear ":</w>
DequantizeLinear ",</w>
1 /
l i
1 8
[ ],</w>
A d
DequantizeLinear_O utput
1 ,</w>
Detector /
2 /ops/ops.
ti on
2 .
w i
/conv 1/ops/ops.
wi se
/ alig_resblk
" c
a tion
{" s
ops .
f use
/Conv2 D
/conv 2/ops/ops.
e ",</w>
c e
1 .
scal e",</w>
_ name":</w>
5 /Conv
zero_point "]},</w>
Ad d_
onnx::Conv_ 6
bia s_
n _
b n_
_output_0_ vaip_
R es
I n
/Conv2D _
l o
i d
" d
_point wise
w o
wo F
woF r
woFr am
woFram e
woFrame A
woFrameA rc
woFrameArc h
woFrameArch ai
woFrameArchai 0
woFrameArchai0 f
woFrameArchai0f 18
g en
gen /
gen/ T
gen/T woFrameArchai0f18
) ":</w>
z ation
stan ce
stance Norm
stanceNorm al
stanceNormal i
stanceNormali zation
In stanceNormalization
_ vaip_
fuse d_
fused_ bn_
c onv
a pe":</w>
st r
str id
1 2
sh ape":</w>
1 ],</w>
gen/TwoFrameArchai0f18 5/Conv
weigh t_
weigh t
u b
ub g
y Relu
k yRelu
ea kyRelu
L eakyRelu
c k
" t
st ":</w>
{"s rc
{"src ":</w>
"t ype":</w>
"d st":</w>
/Conv2 d_
e r
" /cond_resblk
2 /Conv
i x
f ix
[ 0,</w>
Detector/ Res
1 /Conv2d_
[ 1,</w>
lo ck
Detector/Res B
Detector/ResB lock
f c
C on
{" op
{"op _name":</w>
strid e":</w>
d at
dat at
datat ype":</w>
"out_tensor_ stride":</w>
"out_tensor_ shape":</w>
"out_tensor_ name":</w>
"out_tensor_ datatype":</w>
" /resnet_enc/resblk
0/ InstanceNormalization
X I
XI N
XIN T
XINT 8
XINT8 "},</w>
" XINT8"},</w>
a p
_1 /
fix ",</w>
- fix",</w>
QuantizeLinear ",</w>
QuantizeLinear ":</w>
2 _
u p
" DequantizeLinear",</w>
4 _
t c
C li
tc ut
sh or
shor tcut
Cli p_
3 _
zero_point ":</w>
scal e":</w>
uantize d
r e
q uantized
Con stan
Constan t_
3 2
h Norm
c hNorm
at chNorm
B atchNorm
Relu :0_
"( /resnet_enc/resblk
1/ LeakyRelu
h _
v 1/Conv2d_
s_ v1/Conv2d_
res s_v1/Conv2d_
p ress_v1/Conv2d_
o m
om press_v1/Conv2d_
N D
ND Conv
A NDConv
1. ops.
at e
6 4
" s
ubg r
ubgr ap
ubgrap h_
ubgraph_ (
"s ubgraph_(
" /alig_resblk
:0_ vaip_
DequantizeLinear_Output_vaip_ 2
_pointwise ANDConv
" onnx::Conv_6
/Conv /
bia s
1 3
a /conv2/ops/ops.
onnx:: Clip_
0 .
1 6
/ shortcut
r an
ran s
DequantizeLinear_Output ",</w>
w n
o wn
weight s_
3 ,</w>
weights_ fused_bn_
bias_ fused_bn_
/Conv2D_ weights_fused_bn_
/Conv2D_ bias_fused_bn_
"( /cond_resblk
. conv
es ":</w>
o bi
obi l
obil en
Detector/ResBlock _1
" gen/TwoFrameArchai0f185/Conv
6 _
1 9
"c on
ond_ fc
0/InstanceNormalization _output_0_
1 _
"input "},</w>
1 /Conv
a d
weight s
st -fix",</w>
"con st-fix",</w>
1 _output_0_
/conv1/ops/ops. 2/Conv
3 /
8 ,</w>
onnx::Conv_ 5
1/LeakyRelu _output_0_
rans po
2. weight_
2. ops.
DequantizeLinear_Output_vaip_ 3
0 ",</w>
ranspo se
5 )",</w>
"( onnx::Clip_
Constant_ 1_output_0_
u l
M ul
e _
) _
0 )",</w>
" QuantizeLinear",</w>
onnx:: Add_
0 ],</w>
utput ",</w>
_O utput",</w>
QuantizeLinear _Output",</w>
S p
Detector/ResBlock _
li c
a r
"( onnx::Conv_6
s am
sam p
samp l
up lic
uplic ate
d uplicate
DequantizeLinear_Output /
DequantizeLinear_Output/ duplicate
7 _
n orm
own sampl
k D
kD ownsampl
ar kDownsampl
Detector/ D
Detector/D arkDownsampl
quantized ":</w>
quantized ",</w>
3 )",</w>
2 d_
s ":</w>
DequantizeLinear_Output/duplicate d_
norm 2/
"input .
use d
used BatchNorm
usedBatchNorm V
usedBatchNormV 3
F usedBatchNormV3
BatchNorm /
BatchNorm/ FusedBatchNormV3
5 6
c ompress_v1/Conv2d_
1 4
/c ond_fc
7 )",</w>
5 _
li t_
Sp lit_
8 _
. 1/ops/ops.
9 _
Detector/DarkDownsampl e_
9 )",</w>
_pointwiseANDConv 2d_
_pointwise /Conv/
8 )",</w>
BatchNorm/FusedBatchNormV3 :0_vaip_
{"s ubg
{"subg _name":</w>
nam es":</w>
_ names":</w>
"op _names":</w>
b /conv2/ops/ops.
" Conv
Ad d
"( /alig_resblk
"c ompress_v1/Conv2d_
2 4
re f
ref in
refin er
2 )",</w>
" ],</w>
m m
1 )",</w>
Constant_ output_0_
e mm
G emm
6 )",</w>
13 _pointwiseANDConv
1 _1
"( gen/TwoFrameArchai0f185/Conv
resnet_enc .
resnet_enc. resblk
3 ],</w>
DequantizeLinear_Output "],</w>
) "]},</w>
a s
a /shortcut
a/shortcut /shortcut
2 d
0. weight_
B i
re p_
rep_ conv
a/conv2/ops/ops. 0/
g ate
Bi as
e t
) (
t o
to k
tok en
DequantizeLinear_Output/duplicated_ token
Add_ output_0_
2 ,</w>
2_ 2/
T ranspose
bias es
1 7
_ output_
1 5
64 ,</w>
4 )",</w>
" onnx::Add_
v 1/
v1/ M
v1/M obilen
v1/Mobilen et
v1/Mobilenet V
obilen et_
obilenet_ v1/MobilenetV
m obilenet_v1/MobilenetV
3_ 2/
0/ Gemm
"gen/TwoFrameArchai0f185/Conv _
d e
Detector /Conv
" Detector/ResBlock_1
"c ond_resblk
0/InstanceNormalization _output_0_vaip_
"( 3
mobilenet_v1/MobilenetV 1/Conv2d_
"(onnx::Clip_ 6
9 9
biases :0_
1.ops. 2.weight_
1. weight_
.conv 2.ops.
" 3
32 ,</w>
1 0
" p
" 2
weights "},</w>
bias "},</w>
" weights"},</w>
" bias"},</w>
i l
" onnx::Conv_5
64 ],</w>
/ Relu:0_
"gen/TwoFrameArchai0f185/Conv _1
/conv1/ops/ops. 1/LeakyRelu_output_0_
/conv1/ops/ops.2/Conv _output_0_
/Conv _1/
DequantizeLinear_Output_vaip_ 4
gate /ops/ops.
Bias Add
1/Conv _output_0_
8 ],</w>
[" /cond_resblk
Split_ output_
DequantizeLinear_Output/duplicated_token _
{" /resnet_enc/resblk
3 8
{" /cond_resblk
P o
2 56
tec t_
tect_ fc
k de
kde tect_fc
4_ 2/
[" /resnet_enc/resblk
" strid
/ refiner
12 8,</w>
/Conv _1
"c onv
a/shortcut/shortcut .1/ops/ops.
"( compress_v1/Conv2d_
" g
" alig_resblk
" Detector/ResBlock_
4 ,</w>
o d
" onnx::Conv_
weights :0_
12 8],</w>
/conv1/ops/ops. 0/InstanceNormalization_output_0_
Add_ 2
2/Conv _output_0_
2 0
c a
ca t_
2d -fix",</w>
n el
nel _
nel_ shape":</w>
k er
ker nel_shape":</w>
Conv Transpose
"strid es":</w>
"p ad
" kernel_shape":</w>
"pad s":</w>
. 1.ops.
LeakyRelu _output_0_
o l
DequantizeLinear_Output )",</w>
2. conv
0. bias_
up ":</w>
ro up":</w>
il ation
ilation s":</w>
"g roup":</w>
"d ilations":</w>
norm2/ InstanceNormalization
h ap
"conv 2d-fix",</w>
/cond_fc /cond_fc
/ Add_output_0_
ad d
6 ,</w>
/conv1/ops/ops.2/Conv _output_0_vaip_
"Conv ",</w>
a g
2. bias_
.conv 1.ops.2.weight_
Relu ",</w>
ag e
d own
c ond_resblk
" Detector/DarkDownsample_
0_ vaip_
2 8
/refiner /
" resnet_enc.resblk
"/resnet_enc/resblk 5
"/resnet_enc/resblk 4
{" /alig_resblk
a/conv2/ops/ops.0/ Constant_1_output_0_
3 7
"/resnet_enc/resblk 6
4 _1
3 _1
2 _1
2 9
. ops.
"/alig_resblk 2/
"/alig_resblk 1/
l a
0/Gemm _output_0_
m o
ig mo
_output_ 0",</w>
[ "(
[" /alig_resblk
32 ],</w>
/cond_fc/cond_fc .1/ops/ops.
S igmo
"(gen/TwoFrameArchai0f185/Conv _
T o
1 1
"/resnet_enc/resblk 3
"/resnet_enc/resblk 2
i ze
hap e
a d_
Res ize
5 /
2/Conv _output_0_vaip_
lo ad_
13_pointwiseANDConv /Conv
13_pointwiseANDConv/Conv _
Split_ output_0_
19 2,</w>
1/Conv _output_0_vaip_
4 7
"( onnx::Conv_
"( Detector/ResBlock_1
1/LeakyRelu _output_0_vaip_
"/alig_resblk 3/
2 7
)( bias
1 _1/
2 _vaip_
"(/resnet_enc/resblk 5
"(/resnet_enc/resblk 4
ond_fc .1.ops.
c ond_fc.1.ops.
[ 3,</w>
5 8
/resnet_enc /conv1/ops/ops.
Po ol
onnx:: ConvTranspose
onnx::ConvTranspose _
DequantizeLinear_Output_vaip_ 5
/Conv/ Relu:0_
16 ,</w>
1. bias_
4 9
"( onnx::Conv_5
"(/resnet_enc/resblk 3
"(/resnet_enc/resblk 2
" e
/conv2/ops/ops. 0/
"(gen/TwoFrameArchai0f185/Conv _1
3 9
/conv /ops/ops.
3 4
y er
yer s_
yers_ up
yers_up .
la yers_up.
shortcut /ops/ops.
a/conv2/ops/ops.0/ Constant_output_0_
4 _1/
3 _1/
2 _1/
"(/resnet_enc/resblk 6
" Relu",</w>
_t ranspose
i c
A v
Split_output_ 1_
/cond_fc/cond_fc.1/ops/ops. 0/Gemm_output_0_
.conv2.ops. 2.weight_
. rep_conv
" mobilenet_v1/MobilenetV1/Conv2d_
" Detector/Conv
2 3
1 ]},</w>
od in
odin g
enc oding
/c on
" Clip_
4 /
d ic
fuse 1/ops/ops.
at Mul
M atMul
Add_2 _output_0_
6 _vaip_
. 0/
BiasAdd :0_vaip_
7 5
gen/TwoFrameArchai0f185/Conv _
_ out
Con cat_
"( Detector/ResBlock_
Mul _output_0_
1.ops. 2.bias_
)(bias )",</w>
: 0
2 ],</w>
5 _vaip_
"/cond_resblk 2_2/
rans f
op t
)_ opt
a ce
"/resnet_enc/resblk 1
"/cond_resblk 3_2/
add :0_
1 0_
"subgraph_( onnx::Clip_
" /
norm2/ Constant_1_output_0_
tion _
tion_ fc
re dic
redic tion_fc
DequantizeLinear_Output/duplicated_ vaip_
"(/cond_resblk 2_2/
/Conv_1/ Relu:0_
l kdetect_fc
in kdetect_fc
bl inkdetect_fc
am lkdetect_fc
norm2/InstanceNormalization _output_0_
a /Add_output_0_
12 _
/conv2/ops/ops.0/ LeakyRelu_output_0_
/conv2/ops/ops. 1/Conv_output_0_
/Conv /Conv2D_weights_fused_bn_
/Conv /Conv2D_bias_fused_bn_
/ Av
ransf er
encoding s_
3 )":</w>
0 )":</w>
wise -fix",</w>
t wise-fix",</w>
el twise-fix",</w>
" eltwise-fix",</w>
t h
p th
3 5
"( resnet_enc.resblk
256 ],</w>
gen/TwoFrameArchai0f185/Conv _1
"/cond_resblk 4_2/
_ _
Relu ":</w>
/resnet_enc/conv1/ops/ops. 1/
"( cond_resblk
"( Detector/DarkDownsample_
Add_ 1
/conv1/ops/ops. 0/InstanceNormalization_output_0_vaip_
2 4_
ransfer MatMul
ransferMatMul To
ransferMatMulTo Conv
ransferMatMulToConv 2d
bias_ 4
bias_4 bn_
T ransferMatMulToConv2d
)( TransferMatMulToConv2d
"Conv _1
norm2/ Constant_output_0_
_pointwise /
9 6,</w>
/Conv_1 /Conv2D_weights_fused_bn_
/Conv_1 /Conv2D_bias_fused_bn_
"( alig_resblk
load_ 0",</w>
ea d
0 ":</w>
"(/cond_resblk 3_2/
5 1
er age
erage Pool
6 )":</w>
1 _vaip_
"subgraph_( /cond_resblk
3 _vaip_
2 )":</w>
/ BatchNorm/FusedBatchNormV3:0_vaip_
" Conv_
256 ,</w>
input .
[ "input.
6 2_
1_1 /conv1/ops/ops.
down /Av
down/Av eragePool
a/shortcut/shortcut .0/
a/shortcut/shortcut.0/ down/AveragePool
point wise
i d_
_transpose _
Sigmo id_
10_ pointwise
/refiner/ rep_conv
[ 64,</w>
5 )":</w>
19 2],</w>
"gen/TwoFrameArchai0f185/Conv_ 2
p rediction_fc
Add ",</w>
8 _vaip_
_pointwise/Conv/ Relu:0_
4_ 2
3_ 2
2_ 2
refiner .rep_conv
_pointwise/Conv/ weights:0_
_pointwise/Conv/ biases:0_
2.conv 2.ops.
. weight_
4 _vaip_
12 ,</w>
"(/alig_resblk 2/
"(/alig_resblk 1/
{" onnx::Conv_6
u p_
_ 6
[" onnx::Conv_6
DequantizeLinear_Output "]},</w>
99 99
t_ f
Res hape
DequantizeLinear_Output_vaip_ 32
Sigmoid_ output_0_
"(/resnet_enc/resblk 1
5 7
[" onnx::Add_
13_pointwiseANDConv /con
"subgraph_( /resnet_enc/resblk
: 0",</w>
)_ down
a ":</w>
4 8
24 ,</w>
1_1/conv1/ops/ops. 0/
"onnx::Conv_6 5
"onnx::Conv_6 3
"onnx::Conv_6 0
"onnx::Conv_5 9
"/alig_resblk 3
"/alig_resblk 2
2 6
/conv1/ops/ops. 1/LeakyRelu_output_0_vaip_
/Conv2D_weights_fused_bn_ DequantizeLinear_Output_vaip_
5 4
38 4,</w>
8 0_
/Conv2D ":</w>
output_ 0
DequantizeLinear_Output_vaip_3 4
1 },</w>
t s
st age
stage 0/
stage0/ x
st P
stP ro
stPro c
stProc es
stProces s
stProcess /
stProcess/ stage0/x
gen/TwoFrameArchai0f18 5/
Po stProcess/stage0/x
2 5
/conv _out
a/shortcut/shortcut.0/down/AveragePool _output_0_
a c
1 )":</w>
"/cond_resblk 1_1/
4 0
Reshape _output_0_
7 _vaip_
cond_fc.1.ops. 0.weight_
cond_fc.1.ops. 0.bias_
[ 128,</w>
DequantizeLinear_Output_vaip_3 0
/Conv/ BatchNorm/FusedBatchNormV3:0_vaip_
)_opt ",</w>
"subgraph_(onnx::Clip_ 6
"subgraph_( /alig_resblk
"compress_v1/Conv2d_ 13_pointwiseANDConv/Conv_
" onnx::ConvTranspose_
res hape
DequantizeLinear_Output_vaip_2 8
0 /Conv
"(/alig_resblk 3/
" Add",</w>
{" compress_v1/Conv2d_
c at
_ In
_In put
[" compress_v1/Conv2d_
QuantizeLinear _Input
5 3
t /
lo g
log i
logi ts
ac t/
Detector/ logits
0/InstanceNormalization ":</w>
"onnx::Conv_6 7
"onnx::Conv_6 6
"onnx::Conv_6 4
"onnx::Conv_6 2
"onnx::Conv_5 8
"alig_resblk 3
"alig_resblk 1.
"( mobilenet_v1/MobilenetV1/Conv2d_
" layers_up.
encodings_ fc
e d_
Sigmo id
DequantizeLinear_Output_vaip_3 5
DequantizeLinear_Output/duplicated_token _1
9 )":</w>
_ _1
Bias Add_
3 6
"Conv Transpose
"( Detector/Conv
DequantizeLinear_Output_vaip_2 4
6_ DequantizeLinear":</w>
4 8,</w>
3 0
1 17
/Conv2D_bias_fused_bn_ DequantizeLinear_Output_vaip_
)_ up
a/conv2/ops/ops.0/Constant_1_output_0_ DequantizeLinear_Output/duplicated_token_
[ 32,</w>
4 ],</w>
/c amlkdetect_fc
r ead
read :0_
on e
one .
gate .ops.
fuse 1.ops.
ck b
ckb one.
b/conv2/ops/ops. 2/Conv_output_0_
b/conv2/ops/ops. 1/LeakyRelu_output_0_
b/conv2/ops/ops. 0/InstanceNormalization_output_0_
b a
ba ckbone.
b /conv1/ops/ops.2/Conv_output_0_
b /conv1/ops/ops.1/LeakyRelu_output_0_
b /conv1/ops/ops.0/InstanceNormalization_output_0_
b .conv2.ops.2.weight_
b .conv1.ops.2.weight_
a/conv2/ops/ops. 2/Conv_output_0_
a/conv2/ops/ops. 1/LeakyRelu_output_0_
a/conv2/ops/ops. 0/InstanceNormalization_output_0_
a /conv1/ops/ops.2/Conv_output_0_
a /conv1/ops/ops.1/LeakyRelu_output_0_
a /conv1/ops/ops.0/InstanceNormalization_output_0_
a .conv2.ops.2.weight_
a .conv1.ops.2.weight_
Split_output_ 1
DequantizeLinear_Output_vaip_2 9
2/ops/ops. 1/
/ read:0_
. bias_
. 0.weight_
"/cond_resblk 4_1/
"/cond_resblk 3_1/
"/cond_resblk 2_1/
fix _
/ up_
or d
gate/ops/ops. 0/
b /Add_output_0_
DequantizeLinear_Output_vaip_2 2
Add_1 _output_0_vaip_
16 /
1/LeakyRelu ":</w>
"onnx::Conv_ 4
"/alig_resblk 1
p h
ph a":</w>
al pha":</w>
" alpha":</w>
{" Clip_
_output_ 0
[" onnx::Clip_
Add_2 _output_0_vaip_
reshape d
13_pointwiseANDConv/con cat_
"( e
{" input.
b /conv1/ops/ops.2/Conv_output_0_vaip_
a /conv1/ops/ops.2/Conv_output_0_vaip_
/Conv_1/ BatchNorm/FusedBatchNormV3:0_vaip_
"ConvTranspose _1
"/cond_resblk 1_1
12 28
a /
ConvTranspose _1
8 )":</w>
"(/cond_resblk 4_2/
pth To
pthTo Sp
Mul _1
LeakyRelu ",</w>
De pthToSp
3 3
18 )",</w>
Resize __1
Mul _output_0_vaip_
DequantizeLinear_Output_vaip_2 3
Add_ output_0
4 )":</w>
"onnx::Conv_6 8
gen/TwoFrameArchai0f185/ ad
gen/TwoFrameArchai0f185/ad d_
b/conv2/ops/ops. 2/Conv_output_0_vaip_
[" onnx::Conv_
DequantizeLinear_Output_vaip_3 3
DequantizeLinear_Output_vaip_2 5
/conv_out 1/ops/ops.
)(TransferMatMulToConv2d )",</w>
1228 8,</w>
{" onnx::Add_
ord er
norm2/InstanceNormalization _output_0_vaip_
act/ LeakyRelu_output_0_
_1/ Relu:0_
[" Detector/ResBlock_1
"/cond_resblk 4_1
"/cond_resblk 3_1
"/cond_resblk 2_1
{" Detector/ResBlock_1
shortcut .1.ops.
shortcut.1.ops. 1.weight_
a/shortcut/shortcut.1/ops/ops. 1/Conv_output_0_
a/shortcut/shortcut.1/ops/ops. 0/InstanceNormalization_output_0_
a .
a. shortcut.1.ops.1.weight_
4 6
2/ Relu:0_
2.ops. 0.weight_
2.ops. 0.bias_
1.ops. 0.weight_
0/Gemm _output_0
.conv2.ops. 1.weight_
.conv2.ops. 1.bias_
.conv 1.ops.2.bias_
r a
:0_ QuantizeLinear":</w>
:0_ DequantizeLinear":</w>
7_ DequantizeLinear":</w>
7 )":</w>
_pointwise/Conv/ BiasAdd:0_vaip_
DequantizeLinear_Output_vaip_ 14
6 0,</w>
"(gen/TwoFrameArchai0f185/Conv_ 2
a/conv2/ops/ops. 2/Conv_output_0_vaip_
_vaip_ 4
DepthToSp ace
16 ],</w>
12 )",</w>
"Detector/ResBlock_1 7
"Detector/ResBlock_ 8
"Detector/ResBlock_ 6
" Add_
{" gen/TwoFrameArchai0f185/Conv_
_ 7
[" gen/TwoFrameArchai0f185/Conv_
Relu :0",</w>
DequantizeLinear_Output_vaip_2 6
:0 "]},</w>
6_ zero_point"]},</w>
6_ scale",</w>
6 8_
5 9
48 0,</w>
3 1
)_down load_0",</w>
"( /resnet_enc/conv1/ops/ops.1/
w _output_
w_output_ __
ra w_output___
a/shortcut/shortcut.1/ops/ops. 1/Conv_output_0_vaip_
BiasAdd_ raw_output___
5_ DequantizeLinear":</w>
/conv2/ops/ops. 1/Conv_output_0_vaip_
/Conv2D_weights_fused_bn_ DequantizeLinear":</w>
/Conv2D_bias_fused_bn_ DequantizeLinear":</w>
"(onnx::Conv_6 5
"(onnx::Conv_6 3
"(onnx::Conv_6 0
"(/cond_resblk 1_1/conv1/ops/ops.0/
p s
Concat_ output_0_
5 5
{" Conv
{"Conv _1
9_ DequantizeLinear":</w>
3_ DequantizeLinear":</w>
o _
add :0_vaip_
DequantizeLinear_Output_vaip_2 7
DequantizeLinear_Output_vaip_ 13
5/Conv _1
4_ DequantizeLinear":</w>
"( /
pth wise
a/conv2/ops/ops.0/Constant_output_0_ DequantizeLinear_Output/duplicated_token_
1 5)",</w>
"(compress_v1/Conv2d_ 13_pointwiseANDConv/Conv_
t_f ol
t_fol d_
t_fold_ op
t_fold_op t_
s t_fold_opt_
e _1
_pointwiseANDConv2d_ 13
[ 2,</w>
Detector/DarkDownsampl e_1
:0_ scale",</w>
75 },</w>
18 75},</w>
12 _pointwiseANDConv2d_13
117 1875},</w>
0. 0
0.0 1171875},</w>
"onnx::Conv_6 1
"onnx::Conv_5 7
"/cond_resblk 4_2
"/cond_resblk 3_2
"/cond_resblk 2_2
"(onnx::Conv_5 9
" refiner.rep_conv
" LeakyRelu",</w>
{" gen/TwoFrameArchai0f185/Conv_1
DequantizeLinear_Output_vaip_2 0
9 _vaip_
1 ":</w>
0_ DequantizeLinear":</w>
l at
lat P
latP /
_pointwiseANDConv2d_ 9
_pointwiseANDConv2d_ 8
_pointwiseANDConv2d_ 7
_pointwiseANDConv2d_ 6
_pointwiseANDConv2d_ 5
_pointwiseANDConv2d_ 12
_pointwiseANDConv2d_ 10_pointwise
[" Detector/ResBlock_
F latP/
Detector/logits FlatP/
ANDConv 2d_
ANDConv2d_ 11
9 _pointwiseANDConv2d_10_pointwise
8 _pointwiseANDConv2d_9
75 2
7 _pointwiseANDConv2d_8
6 _pointwiseANDConv2d_7
5 _pointwiseANDConv2d_6
4 _pointwiseANDConv2d_5
11 _pointwiseANDConv2d_12
10_pointwise ANDConv2d_11
"compress_v1/Conv2d_ 13_pointwiseANDConv
de pthwise
:0_ zero_point"]},</w>
7 1_
5 12,</w>
"Detector/DarkDownsample_ 9
"Detector/DarkDownsample_ 7
"Detector/DarkDownsample_ 3
{" Detector/ResBlock_
st_fold_opt_ _7
refiner .conv
output_ 0",</w>
od er
oder .
oder. fc
norm2/Constant_output_0_ DequantizeLinear_Output/duplicated_token_
ec oder.fc
depthwise /
depthwise/ biases:0_
d ecoder.fc
c _
backbone. decoder.fc
[" gen/TwoFrameArchai0f185/Conv_1
InstanceNormalization ",</w>
8_ DequantizeLinear":</w>
2.conv2.ops. 1.weight_
2.conv2.ops. 1.bias_
2.conv 1.ops.2.weight_
2.conv 1.ops.2.bias_
2 2
18 _
1.ops. 0.bias_
0/ Relu:0_
)_ fix_
"Detector/ResBlock_1 3
"Detector/ResBlock_ 4
"Detector/ResBlock_ 2/Conv
"(onnx::Conv_6 4
"(onnx::Conv_6 2
stan c
stanc en
stancen orm
stancenorm -fix",</w>
ps il
psil on
psilon ":</w>
in stancenorm-fix",</w>
e -
e- 0
e-0 6
e-06 },</w>
[ 64],</w>
Constant_1_output_0_ DequantizeLinear_Output/duplicated_token_1
9999 99
999999 7
9999997 47
999999747 37
99999974737 8
999999747378 752
999999747378752 e-06},</w>
9 .
9. 999999747378752e-06},</w>
)_up load_0",</w>
"e psilon":</w>
" instancenorm-fix",</w>
" InstanceNormalization",</w>
_pointwise /Conv2D_
_pointwise/Conv2D_ a/
Mul ",</w>
Detector /con
4 _pointwise/Conv2D_a/
2_ DequantizeLinear":</w>
"Detector/ResBlock_1 0
"(onnx::Clip_ 64
"(onnx::Clip_ 58
"( layers_up.
DequantizeLinear_Output_vaip_ 16
1_ DequantizeLinear":</w>
" /refiner/
ai l
_t ail
9 6
2/ops/ops.1/ Sigmoid_output_0_
14 )",</w>
1/ops/ops. 1/LeakyRelu_output_0_
"cond_resblk 4_
"cond_resblk 3_
"cond_resblk 2_
"3 5
"3 3
"3 0
"(onnx::Clip_6 7
"(3 0
" 32
" /refiner/rep_conv
DequantizeLinear_Output_vaip_ 15
56 ,</w>
4 4
3 0)",</w>
{"/resnet_enc/resblk 6
{"/resnet_enc/resblk 5
{"/resnet_enc/resblk 4
a/Add_output_0_ vaip_
["/resnet_enc/resblk 5
["/resnet_enc/resblk 4
BatchNorm/FusedBatchNormV3 :0"]},</w>
8 ":</w>
/Conv2D ",</w>
"(onnx::Conv_5 8
t_f ace
sc or
r el
rel i
reli t_face
e y
c_ ey
["/resnet_enc/resblk 6
[ 256,</w>
PostProcess/stage0/x 1/
PostProcess/stage0/x 0.
PostProcess/stage0/x0. 5/
7 ,</w>
"(/alig_resblk 3
"(/alig_resblk 2
"( 32
{"/resnet_enc/resblk 3
{"/resnet_enc/resblk 2
{"/alig_resblk 2/
{"/alig_resblk 1/
{" onnx::Conv_
{" Conv_
load_ 0":</w>
[" onnx::Conv_5
7_ zero_point"]},</w>
7_ scale",</w>
38 4],</w>
2 8,</w>
16 )",</w>
" Relu
DequantizeLinear_Output_vaip_ 12
8 6_
5 2
3_ zero_point"]},</w>
3_ scale",</w>
20 480,</w>
"(3 4
{"/alig_resblk 3/
g Pool
a x
["onnx::Clip_ 6
["/resnet_enc/resblk 3
["/resnet_enc/resblk 2
Split_output_1 )_opt",</w>
Add_output_0 )_opt",</w>
8 192,</w>
4_ zero_point"]},</w>
4_ scale",</w>
4 2
24 )",</w>
/Relu:0_ zero_point"]},</w>
/Relu:0_ scale",</w>
. cond_fc.1.ops.0.weight_
. cond_fc.1.ops.0.bias_
)( reshaped
"2 3
"(onnx::Conv_6 7
"(onnx::Conv_6 6
["/alig_resblk 2/
["/alig_resblk 1/
Detector/ DepthToSpace
6 8,</w>
56 )",</w>
3/ Relu:0_
3 3)",</w>
3 ":</w>
/Conv _output_0_vaip_
"(3 5
{" Detector/DarkDownsample_
shortcut/ops/ops. 0/InstanceNormalization_output_0_
b /conv1/ops/ops.
a /conv1/ops/ops.
[" Detector/DarkDownsample_
[ 128],</w>
96 ],</w>
2_ zero_point"]},</w>
2_ scale",</w>
18 0_
16 384,</w>
0/InstanceNormalization _output_0",</w>
0/InstanceNormalization ",</w>
"cond_resblk 4_1
"cond_resblk 3_1
"cond_resblk 2_1
"cond_resblk 1_1
"alig_resblk1. conv
"alig_resblk 2.
"Detector/ResBlock_1 1/Conv
"3 4
["/alig_resblk 3/
9_pointwiseANDConv2d_10_pointwise /Conv/
6 0)",</w>
5_ zero_point"]},</w>
5_ scale",</w>
58 _vaip_
13 )",</w>
12 ],</w>
/ add:0_
{" onnx::Conv_5
od e":</w>
m ode":</w>
gate/ops/ops.0/ Constant_1_output_0_
_1/ BatchNorm/FusedBatchNormV3:0_vaip_
[ 32],</w>
Add ":</w>
0/Conv _output_0_
0 "]},</w>
"( onnx::ConvTranspose_
{" cond_resblk
weights /read:0_
t ed_
shortcut/ops/ops. 1/Conv_output_0_
shortcut .ops.
shortcut.ops. 1.weight_
se r
ser ted_
re order
reorder e
reordere d
in serted_
gate/ops/ops. 1/LeakyRelu_output_0_
gate/ops/ops. 0/InstanceNormalization_output_0_
gate.ops. 2.weight_
gate.ops. 2.bias_
fuse1/ops/ops. 1/Conv_output_0_
fuse1/ops/ops. 0/InstanceNormalization_output_0_
fuse1.ops. 1.weight_
fuse1.ops. 1.bias_
biases /read:0_
_pointwise/ weights:0_
_pointwise/ biases:0_
[" cond_resblk
Mul_1 _output_0_
DequantizeLinear_Output_vaip_ 1
Constant_output_0_ DequantizeLinear_Output/duplicated_token_
9_ zero_point"]},</w>
9_ scale",</w>
9 2
6_ zero_point":</w>
6_ scale":</w>
6_ QuantizeLinear":</w>
6_ DequantizeLinear",</w>
2. shortcut.ops.1.weight_
/up_ blk
/conv/ops/ops. 2/Conv_output_0_
.ops. 2.weight_
.ops. 2.bias_
)_ reordered
"(alig_resblk 3
"(alig_resblk 1.
"(/cond_resblk2_2/ norm2/Constant_1_output_0_
"( 23
h ead
_ head
Mul ":</w>
2 ]},</w>
1/LeakyRelu _output_0",</w>
1/LeakyRelu ",</w>
/conv1/ops/ops.2/Conv ":</w>
)_ inserted_
"2 9
p ad
_vaip_ 6
6 ":</w>
2/ops/ops. 0/Gemm_output_0_
/cond_fc/cond_fc .0/
"Detector/DarkDownsample_ 5/Conv
shortcut/ops/ops. 1/Conv_output_0_vaip_
gate/ops/ops.0/ Constant_output_0_
gate/ops/ops. 2/Conv_output_0_
b/conv2/ops/ops. 0/InstanceNormalization_output_0_vaip_
b /conv1/ops/ops.0/InstanceNormalization_output_0_vaip_
a/conv2/ops/ops. 0/InstanceNormalization_output_0_vaip_
a /conv1/ops/ops.0/InstanceNormalization_output_0_vaip_
[ 7
Concat_ 1_output_0_
BiasAdd ":</w>
8_ zero_point"]},</w>
8_ scale",</w>
7 5)",</w>
6 9)",</w>
24 0,</w>
1/Conv ":</w>
0/Gemm_output_0 )(TransferMatMulToConv2d)",</w>
/Relu:0_ QuantizeLinear":</w>
/Relu:0_ DequantizeLinear":</w>
"Detector/ResBlock_1 5/Conv
"(onnx::Clip_6 0
"(onnx::Clip_ 59
"(Detector/ResBlock_ 8
"(Detector/ResBlock_ 6
"(3 3
"(/cond_resblk 1_1/
"( input.
" /camlkdetect_fc
7 2)",</w>
64 )",</w>
2_vaip_ 2
14 4,</w>
1 ",</w>
)(bias )":</w>
"/ blinkdetect_fc
"(Detector/ResBlock_1 7
"( 29
" 19
" 17
{"/resnet_enc/resblk 1
output_ t
Resize__1 51
Resize __
9 ":</w>
8 ",</w>
5 12],</w>
2 24_
1_ zero_point"]},</w>
1_ scale",</w>
19 )",</w>
/refiner /conv
/cond_fc/cond_fc.1/ops/ops.0/Gemm_output_0_ zero_point"]},</w>
/cond_fc/cond_fc.1/ops/ops.0/Gemm_output_0_ scale",</w>
/cond_fc/cond_fc.1/ops/ops. 0/Gemm
)_opt ":</w>
"subgraph_( compress_v1/Conv2d_
"resnet_enc.resblk 6
"resnet_enc.resblk 5
"resnet_enc.resblk 4
"resnet_enc.resblk 3
"resnet_enc.resblk 2
"onnx::Add_ 49
"3 6
"2 0
"(onnx::Conv_6 8
"(onnx::Conv_6 1
"(/cond_resblk 4_1/
"(/cond_resblk 3_1/
"(/cond_resblk 2_1/
" gen/TwoFrameArchai0f185/add_
" /resnet_enc/conv1/ops/ops.1/
re d_
red_ la
red_la b
red_lab el
["/resnet_enc/resblk 1
Gemm _
Conv_ _6
32 0],</w>
1 0_vaip_
0_ zero_point"]},</w>
0_ scale",</w>
"(3 6
"(/alig_resblk 1
pad ":</w>
5 7)",</w>
5 ":</w>
2/Conv ":</w>
0/Conv _output_0_vaip_
"input _
"compress_v1/Conv2d_13_pointwiseANDConv/Conv_ 4/
"Detector/Conv 18
"Detector/Conv 16/
"/ prediction_fc
"(/cond_resblk 1_1
"( onnx::Add_
"( c
Res hap
:0_ QuantizeLinear_Output",</w>
:0_ QuantizeLinear",</w>
:0_ DequantizeLinear",</w>
7_ zero_point":</w>
7_ scale":</w>
7_ DequantizeLinear",</w>
12 0,</w>
{" alig_resblk
{" Add_
{" /
ut o_
uto_ pad":</w>
output_t ranspose
a uto_pad":</w>
[7 8
[78 64
[7864 32,</w>
[" alig_resblk
T S
TS E
TSE T
TSET ",</w>
PostProcess/stage0/x1/ Sigmoid
PostProcess/stage0/x0.5/ Sigmoid
O TSET",</w>
N OTSET",</w>
DequantizeLinear_Output_vaip_ 19
7 7
4 ":</w>
3 )"]},</w>
2/ BatchNorm/FusedBatchNormV3:0_vaip_
13 6,</w>
1. 0,</w>
0 )"]},</w>
)_reordered ",</w>
"compress_v1/Conv2d_ 13_pointwiseANDConv/concat_
"Conv_ _6
"(onnx::Conv_5 7
"(compress_v1/Conv2d_ 13_pointwiseANDConv
"( refiner.rep_conv
"( input
"( Gemm_
" auto_pad":</w>
" NOTSET",</w>
" /conv_out1/ops/ops.
{" Detector/Conv
a/shortcut/shortcut.1/ops/ops. 0/InstanceNormalization_output_0_vaip_
BiasAdd_raw_output___ 5
BiasAdd_raw_output___ 4
6_ DequantizeLinear_Output",</w>
64 _vaip_
6 6
5_ DequantizeLinear",</w>
3 6)",</w>
3 ",</w>
14 ,</w>
/resnet_enc /conv2/ops/ops.
/Conv2D_weights_fused_bn_ zero_point"]},</w>
/Conv2D_weights_fused_bn_ zero_point":</w>
/Conv2D_weights_fused_bn_ scale":</w>
/Conv2D_weights_fused_bn_ scale",</w>
/Conv2D_weights_fused_bn_ quantized":</w>
/Conv2D_weights_fused_bn_ quantized",</w>
/Conv2D_weights_fused_bn_ DequantizeLinear_Output",</w>
/Conv2D_weights_fused_bn_ DequantizeLinear",</w>
/Conv2D_bias_fused_bn_ zero_point"]},</w>
/Conv2D_bias_fused_bn_ zero_point":</w>
/Conv2D_bias_fused_bn_ scale":</w>
/Conv2D_bias_fused_bn_ scale",</w>
/Conv2D_bias_fused_bn_ quantized":</w>
/Conv2D_bias_fused_bn_ quantized",</w>
/Conv2D_bias_fused_bn_ DequantizeLinear_Output)",</w>
/Conv2D_bias_fused_bn_ DequantizeLinear_Output"],</w>
/Conv2D_bias_fused_bn_ DequantizeLinear",</w>
"(Detector/DarkDownsample_ 9
"(Detector/DarkDownsample_ 7
"(Detector/DarkDownsample_ 3
"(/cond_resblk3_2/ norm2/Constant_1_output_0_
"(/cond_resblk2_2/norm2/Constant_1_output_0_ DequantizeLinear_Output/duplicated_token_
"(/cond_resblk2_2/ norm2/Constant_output_0_DequantizeLinear_Output/duplicated_token_
{" mobilenet_v1/MobilenetV1/Conv2d_
se g
f ace
c_ey e
[" Detector/Conv
[" /
[ 16,</w>
LeakyRelu ":</w>
Detector/logits P
:0_vaip_ 10
9_ DequantizeLinear",</w>
86_ bias_4bn_
80_ bias_4bn_
8 .
8. 0.bias_
71_ bias_4bn_
62_ bias_4bn_
5_ zero_point":</w>
5_ scale":</w>
57 6,</w>
3_ DequantizeLinear",</w>
24 576,</w>
2 ":</w>
"gen/TwoFrameArchai0f185/Conv_1 9
"gen/TwoFrameArchai0f185/Conv_1 6
"Relu _
"2 5
"(Detector/ResBlock_1 3
"(Detector/ResBlock_1 0
"(Detector/ResBlock_ 4
"(Detector/ResBlock_ 2/Conv
[" mobilenet_v1/MobilenetV1/Conv2d_
[" e
[ 6
DequantizeLinear_Output_vaip_ 17
9_ zero_point":</w>
9_ scale":</w>
9 8
5 4)",</w>
4_ zero_point":</w>
4_ scale":</w>
4_ DequantizeLinear",</w>
4 2)",</w>
3_ zero_point":</w>
3_ scale":</w>
scor e_
rep_conv /Conv_output_0_vaip_
relit_face _
output_transpose _
_ Gemm
_Gemm __
MatMul _Gemm__
Detector/logitsFlatP/ MatMul_Gemm__
9 ",</w>
7 2,</w>
6 ",</w>
5_vaip_ 12
32 )",</w>
3 12_
2. cond_fc.1.ops.0.weight_
2. cond_fc.1.ops.0.bias_
2 ",</w>
/cond_fc/cond_fc.0/ LeakyRelu_output_0_
"resnet_enc.resblk 1
"p rediction_fc
"gen/TwoFrameArchai0f185/Conv_2 3/
"conv _out
"con st_fold_opt__7
"c amlkdetect_fc
"alig_resblk3 .
"3 1
"(onnx::Conv_ 4
"( ConvTranspose_1
"( /refiner/rep_conv
" refiner.conv
" encodings_fc
" blinkdetect_fc
" backbone.decoder.fc
" 18
{"/cond_resblk 4_2/
{"/cond_resblk 3_2/
{"/cond_resblk 2_2/
_1 ",</w>
["/cond_resblk 3_2/
["/cond_resblk 2_2/
T an
DequantizeLinear_Output_vaip_4 4
DequantizeLinear_Output_vaip_4 0
DequantizeLinear_Output/duplicated_token_1 0
9 2)",</w>
5 0)",</w>
40 96,</w>
256 0,</w>
"mobilenet_v1/MobilenetV1/Conv2d_ 0/
"gen/TwoFrameArchai0f185/Conv_1 7
"(/cond_resblk 4_1
"(/cond_resblk 3_1
"(/cond_resblk 2_1
" Detector/DarkDownsample_1
up /
s e":</w>
rep_conv .weight_
rep_conv .bias_
red_label s_
ranspo se":</w>
backbone. c
b/conv2/ops/ops. 1/LeakyRelu_output_0_vaip_
b /conv1/ops/ops.1/LeakyRelu_output_0_vaip_
a/conv2/ops/ops.0/Constant_1_output_0_ DequantizeLinear_Output/duplicated_vaip_
a/conv2/ops/ops. 1/LeakyRelu_output_0_vaip_
a /conv1/ops/ops.1/LeakyRelu_output_0_vaip_
_vaip_ 25
["/cond_resblk 4_2/
[" onnx::ConvTranspose_
[ 20480,</w>
Split_output_ 1_1
Resize _output_0_
:0_ DequantizeLinear_Output",</w>
9 6)",</w>
8_ zero_point":</w>
8_ scale":</w>
8_ DequantizeLinear",</w>
8 .0.weight_
7_ QuantizeLinear":</w>
6 .0.weight_
5 1)",</w>
4_ QuantizeLinear":</w>
4 24_
4 .rep_conv
4 .0.weight_
4 ",</w>
3_ QuantizeLinear":</w>
3 9)",</w>
3 .rep_conv
2_ QuantizeLinear":</w>
2. 0.weight_
2 )"]},</w>
1/ Relu:0_
1 12_
1 0)",</w>
0. 0.weight_
/up_blk /up_
/conv/ops/ops. 1/LeakyRelu_output_0_
/conv/ops/ops. 0/InstanceNormalization_output_0_
/ up/
)_fix_ ",</w>
)(reshaped )",</w>
"mobilenet_v1/MobilenetV1/Conv2d_ 3
"mobilenet_v1/MobilenetV1/Conv2d_ 2
"mobilenet_v1/MobilenetV1/Conv2d_ 1
"gen/TwoFrameArchai0f185/Conv_1 8
"gen/TwoFrameArchai0f185/Conv_ 9
"gen/TwoFrameArchai0f185/Conv_ 8
"gen/TwoFrameArchai0f185/Conv_ 7
"gen/TwoFrameArchai0f185/Conv_ 6
"compress_v1/Conv2d_ 8_pointwiseANDConv2d_9
"compress_v1/Conv2d_ 7_pointwiseANDConv2d_8
"compress_v1/Conv2d_ 6_pointwiseANDConv2d_7
"compress_v1/Conv2d_ 5_pointwiseANDConv2d_6
"compress_v1/Conv2d_ 4_pointwiseANDConv2d_5
"compress_v1/Conv2d_ 12_pointwiseANDConv2d_13
"compress_v1/Conv2d_ 11_pointwiseANDConv2d_12
"compress_v1/Conv2d_ 10_pointwiseANDConv2d_11
"Detector/Conv 14
"Detector/Conv 0
"(onnx::Clip_ 57
" 24
{" resnet_enc.resblk
up_ blk
o utput
b/Add_output_0_ vaip_
_ 64
["/cond_resblk 1_1
[" resnet_enc.resblk
[ 58
[58 98
[5898 24,</w>
Detector/logitsFlatP/MatMul_Gemm__ 9
Detector/con cat_
Detector/con cat
DequantizeLinear_Output_vaip_ 18
9 0)",</w>
7 8)",</w>
5 ",</w>
2_ zero_point":</w>
2_ scale":</w>
2_ DequantizeLinear",</w>
2 7)",</w>
2 1
1_ DequantizeLinear",</w>
13_pointwiseANDConv/con cat
0/Gemm_output_0 )(TransferMatMulToConv2d
"gen/TwoFrameArchai0f185/Conv_1 4
"/ up_blk
"(compress_v1/Conv2d_13_pointwiseANDConv/Conv_ 4/
on st_fold_opt__7
g c_eye
conv _out
[ 192,</w>
[ 14
QuantizeLinear_Input _vaip_
DequantizeLinear_Output_vaip_ 56
8_vaip_ 12
8 7)",</w>
6 )"]},</w>
5_ QuantizeLinear":</w>
56 8_vaip_12
1_ zero_point":</w>
1_ scale":</w>
1 7)",</w>
1 14
0_ zero_point":</w>
0_ scale":</w>
0_ DequantizeLinear",</w>
/conv_out 2/ops/ops.
/ Relu":</w>
)_inserted_ fix_
)_down load_0":</w>
"gen/TwoFrameArchai0f185/Conv_1 5
"gen/TwoFrameArchai0f185/Conv_ 5
"gen/TwoFrameArchai0f185/Conv_ 4
"/cond_resblk 1_1/conv1/ops/ops.0/
"(onnx::Conv_ 3
"(onnx::Clip_6 8
"(onnx::Clip_6 6
"(onnx::Clip_6 5
"(onnx::Clip_6 2
" output_
{"/alig_resblk 3
{"/alig_resblk 2
wi tc
witc h_
witch_ input
witch_input s_
witch_inputs_ order
s witch_inputs_order
gate/ops/ops. 2/Conv_output_0_vaip_
fuse1/ops/ops. 1/Conv_output_0_vaip_
fuse1/ops/ops. 0/InstanceNormalization_output_0_vaip_
f lo
["/alig_resblk 3
["/alig_resblk 2
Resize__151 :0_vaip_
Resize__151:0_vaip_ 8
Concat_ 1
Concat_1 _output_0_vaip_
9 9)",</w>
8 4)",</w>
7 4
64_vaip_ 9
5 8)",</w>
5 5)",</w>
4 5)",</w>
1 1)",</w>
0_vaip_ 10
0/ BatchNorm/FusedBatchNormV3:0_vaip_
/conv/ops/ops. 2/Conv_output_0_vaip_
)_ switch_inputs_order
"(alig_resblk1. conv
"(Gemm_ output
" n
{" Relu
mobilenet_v1/MobilenetV 1_1
mobilenet_v1/MobilenetV1_1 /Conv2d_
mobilenet_v1/MobilenetV1_1/Conv2d_ 4_pointwise/Conv2D_a/
load_ 0"]},</w>
lo ad
load ",</w>
_t ranspose":</w>
[ 39
[39 32
[3932 16,</w>
[ 256],</w>
S _1/
Reshap e",</w>
Detector/concat_ 1
DequantizeLinear_Output_vaip_ 10
D 2
D2 S_1/
Con cat
Add_2_output_0_ zero_point"]},</w>
Add_2_output_0_ scale",</w>
9_ QuantizeLinear":</w>
7_ DequantizeLinear_Output",</w>
7 4)",</w>
5 )"]},</w>
3 4,</w>
24 ],</w>
2/ops/ops.1/ Tan
1 14)",</w>
/refiner/conv _tail
/Conv/Relu:0_ zero_point"]},</w>
/Conv/Relu:0_ scale",</w>
/Conv/Relu:0_ QuantizeLinear":</w>
/Conv/Relu:0_ DequantizeLinear":</w>
"subgraph_(/alig_resblk 3/
"subgraph_(/alig_resblk 2/
"subgraph_(/alig_resblk 1/
"2 7
"(Detector/ResBlock_1 1/Conv
"(Detector/DarkDownsample_ 5/Conv
"(Detector/Conv 16/
"(/ prediction_fc
rep_conv/Conv_output_0_vaip_ 17
gPool P
gPoolP /Av
gPoolP/Av gPool
encodings_ QuantizeLinear_Input
[14 74
[1474 56,</w>
Detector/DepthToSpace _1
Detector/ Av
Detector/Av gPoolP/AvgPool
DequantizeLinear_Output_vaip_5 0
:0_ zero_point":</w>
:0_ scale":</w>
92 16,</w>
8_ QuantizeLinear":</w>
7 ":</w>
6 0],</w>
5 0
4_ DequantizeLinear_Output",</w>
34 _vaip_6
20 48,</w>
2 1)",</w>
/refiner /Add_output_0_
)_ ",</w>
"(resnet_enc.resblk 6
"(resnet_enc.resblk 5
"(resnet_enc.resblk 4
"(resnet_enc.resblk 3
"(resnet_enc.resblk 2
"(Detector/ResBlock_1 5/Conv
"(/resnet_enc/conv1/ops/ops.1/ Constant_output_0_DequantizeLinear_Output/duplicated_token_
"(/cond_resblk3_2/norm2/Constant_1_output_0_ DequantizeLinear_Output/duplicated_token_10
"(/cond_resblk3_2/ norm2/Constant_output_0_DequantizeLinear_Output/duplicated_token_
" Mul",</w>
{"/cond_resblk 1_1/
{" e
shortcut/ops/ops. 0/InstanceNormalization_output_0_vaip_
li ce
in f
inf o_
[ 15
[ 117
[117 9
[1179 64
[117964 8,</w>
Resize _output_0_vaip_
Reshape_output_0_ DequantizeLinear_Output",</w>
Mul_1 _output_0_vaip_
DequantizeLinear_Output_vaip_4 6
Concat_output_0_ vaip_
9 )"]},</w>
8_ DequantizeLinear_Output",</w>
8 )"]},</w>
7 ",</w>
5_ DequantizeLinear_Output",</w>
3_ DequantizeLinear_Output",</w>
32 0,</w>
3 _transpose_
28 _vaip_
1/ops/ops. 0/Gemm_output_0)(TransferMatMulToConv2d)",</w>
/resnet_enc/conv1/ops/ops. 2/
/Conv/ Relu":</w>
"subgraph_( gen/TwoFrameArchai0f185/Conv_
"subgraph_( e
"(onnx::ConvTranspose_ 5
"(onnx::Clip_ 568_vaip_12
"(Gemm_output )(TransferMatMulToConv2d)",</w>
"( Conv__6
gate/ops/ops. 0/InstanceNormalization_output_0_vaip_
encoding s
ea res
a/conv2/ops/ops.0/Constant_output_0_ DequantizeLinear_Output",</w>
a/conv2/ops/ops.0/Constant_1_output_0_ DequantizeLinear_Output"],</w>
["/cond_resblk 1_1/
DequantizeLinear_Output_vaip_3 8
D2S_1/ DepthToSpace
6_ quantized":</w>
6_ QuantizeLinear_Output",</w>
2 _transpose_
2 29
18 )":</w>
13 _vaip_
1 _transpose_
0_ QuantizeLinear":</w>
/Conv2D_weights_fused_bn_ DequantizeLinear_Output_vaip_2
"n eares
"(cond_resblk 4_
"(cond_resblk 3_
"(cond_resblk 2_
"(compress_v1/Conv2d_ 13_pointwiseANDConv/concat_
"(/cond_resblk 4_2
"(/cond_resblk 3_2
"(/cond_resblk 2_2
" S
{"/cond_resblk 4_1/
{"/cond_resblk 3_1/
{"/cond_resblk 2_1/
h ape":</w>
_transpose ",</w>
["( onnx::Conv_5
[ 96,</w>
Reshape_output_0_ QuantizeLinear":</w>
Reshape_output_0_ DequantizeLinear":</w>
Res hape":</w>
Mul_output_0_ zero_point"]},</w>
Mul_output_0_ scale",</w>
Mul_output_0_ QuantizeLinear":</w>
Mul_output_0_ DequantizeLinear":</w>
DequantizeLinear_Output_vaip_5 7
DequantizeLinear_Output_vaip_ 8
Clip_ output_0_
Add_1 ":</w>
7_ quantized":</w>
7_ quantized",</w>
6_ QuantizeLinear",</w>
4 6_vaip_
30 72,</w>
2 5)",</w>
2 24,</w>
19 _
11 1)",</w>
1 12,</w>
1 )"]},</w>
/conv1/ops/ops.2/Conv _output_0",</w>
/conv1/ops/ops.2/Conv ",</w>
)_up load_0":</w>
"subgraph_(/resnet_enc/resblk 5
"subgraph_(/resnet_enc/resblk 4
"subgraph_(/resnet_enc/resblk 3
"subgraph_(/resnet_enc/resblk 2
"onnx::Conv_5 2
"onnx::Conv_5 0
"onnx::Conv_4 62_
"onnx::Conv_4 4
"onnx::Conv_4 2
"onnx::Conv_4 10_
"onnx::Conv_ 47
"onnx::Conv_ 39
"onnx::Conv_ 38
"onnx::Conv_ 35
"onnx::Conv_ 34
"onnx::Conv_ 32
"onnx::Conv_ 31
"onnx::Conv_ 29
"onnx::Conv_ 27
"input. 9
"input. 3
"input. 14
"(/cond_resblk3_2/norm2/Constant_output_0_DequantizeLinear_Output/duplicated_token_ 9
"( /conv_out1/ops/ops.
" up
" Transpose
" Resize
{"/alig_resblk 1
scor e
s lice
slice -fix",</w>
lic e",</w>
ed_ slice-fix",</w>
b /
_pointwise/ BiasAdd:0_vaip_
_pointwise /Relu:0_
_ mode":</w>
_ 8
["/cond_resblk 4_1/
["/cond_resblk 3_1/
["/cond_resblk 2_1/
["/alig_resblk 1
BiasAdd_ _6
BiasAdd ",</w>
9_ quantized":</w>
9_ quantized",</w>
6_ quantized",</w>
6_ DequantizeLinear_Output_vaip_2
6 6)",</w>
6 3)",</w>
5_ quantized":</w>
5_ quantized",</w>
27 2,</w>
18 4
16 3)",</w>
15 5)",</w>
15 2,</w>
15 )":</w>
13_pointwiseANDConv/Conv_ 4/
13 7)",</w>
10 24,</w>
1/Conv _output_0",</w>
1/Conv ",</w>
0_ DequantizeLinear_Output",</w>
)_ reshaped
"strid ed_slice-fix",</w>
"S lice",</w>
"(/ blinkdetect_fc
"( gen/TwoFrameArchai0f185/add_
"( Resize__151:0_vaip_8
"( /camlkdetect_fc
{" onnx::ConvTranspose_
t_ d
t_d q
st e
st ar
s_ 0",</w>
s t_dq
po st_dq
p red_labels_
norm2/InstanceNormalization_output_0_ zero_point"]},</w>
norm2/InstanceNormalization_output_0_ scale",</w>
norm2/InstanceNormalization_output_0_ QuantizeLinear":</w>
norm2/InstanceNormalization_output_0_ DequantizeLinear":</w>
norm2/InstanceNormalization ":</w>
m ":</w>
er m":</w>
en d
d )",</w>
ax es
add ":</w>
a/conv2/ops/ops.0/Constant_output_0_ DequantizeLinear_Output/duplicated_vaip_
a/conv2/ops/ops.0/Constant_1_output_0_DequantizeLinear_Output/duplicated_token_ 7
_pointwise/Conv/weights:0_ DequantizeLinear_Output_vaip_14
Split_output_1_1 ":</w>
Split_output_1_ zero_point"]},</w>
Split_output_1_ scale",</w>
Split_output_1_ QuantizeLinear":</w>
Split_output_1_ DequantizeLinear":</w>
Split_output_1 )_opt":</w>
Split_output_0_ zero_point"]},</w>
Split_output_0_ scale",</w>
Split_output_0_ QuantizeLinear":</w>
Split_output_0_ DequantizeLinear":</w>
Split_output_0_ 0":</w>
Resize__1 31
Resize__ 99
Resize__ 77
DequantizeLinear_Output_vaip_4 9
DequantizeLinear_Output_vaip_3 7
DequantizeLinear_Output/duplicate d)",</w>
Add_output_0_ zero_point"]},</w>
Add_output_0_ scale",</w>
Add_output_0_ QuantizeLinear":</w>
Add_output_0_ DequantizeLinear":</w>
Add_output_0 )_opt":</w>
Add_2_output_0_ QuantizeLinear":</w>
Add_2_output_0_ DequantizeLinear":</w>
Add_2 ":</w>
Add_ output_0",</w>
9_ DequantizeLinear_Output",</w>
6_vaip_ 5
6 144,</w>
3 8)",</w>
2_ DequantizeLinear_Output",</w>
2.ops.0.weight_ DequantizeLinear_Output_vaip_4
1_ quantized":</w>
16 _vaip_4
16 0)",</w>
12 )":</w>
10 5)",</w>
1.ops.0.weight_ DequantizeLinear_Output_vaip_4
/conv2/ops/ops.1/Conv_output_0_ zero_point"]},</w>
/conv2/ops/ops.1/Conv_output_0_ scale",</w>
/conv2/ops/ops.1/Conv_output_0_ QuantizeLinear":</w>
/conv2/ops/ops.1/Conv_output_0_ DequantizeLinear":</w>
/conv2/ops/ops.0/LeakyRelu_output_0_ zero_point"]},</w>
/conv2/ops/ops.0/LeakyRelu_output_0_ scale",</w>
/conv2/ops/ops.0/LeakyRelu_output_0_ QuantizeLinear":</w>
/conv2/ops/ops.0/LeakyRelu_output_0_ DequantizeLinear":</w>
/conv2/ops/ops.0/ LeakyRelu":</w>
/conv2/ops/ops. 1/Conv":</w>
/conv1/ops/ops.2/Conv_output_0_ zero_point"]},</w>
/conv1/ops/ops.2/Conv_output_0_ scale",</w>
/conv1/ops/ops.2/Conv_output_0_ QuantizeLinear":</w>
/conv1/ops/ops.2/Conv_output_0_ DequantizeLinear":</w>
/conv1/ops/ops.1/LeakyRelu_output_0_ zero_point"]},</w>
/conv1/ops/ops.1/LeakyRelu_output_0_ scale",</w>
/conv1/ops/ops.1/LeakyRelu_output_0_ QuantizeLinear":</w>
/conv1/ops/ops.1/LeakyRelu_output_0_ DequantizeLinear":</w>
/cond_fc/cond_fc.1/ops/ops.0/Gemm_output_0_ QuantizeLinear":</w>
/cond_fc/cond_fc.1/ops/ops.0/Gemm_output_0_ DequantizeLinear":</w>
/cond_fc/cond_fc.1/ops/ops.0/Gemm ":</w>
/Conv_1/Relu:0_ zero_point"]},</w>
/Conv_1/Relu:0_ scale",</w>
/Conv_1/Relu:0_ QuantizeLinear":</w>
/Conv_1/Relu:0_ DequantizeLinear":</w>
/Conv_1/ Relu":</w>
/Conv2D_weights_fused_bn_DequantizeLinear_Output_vaip_ 18
/Conv2D_weights_fused_bn_DequantizeLinear_Output_vaip_ 17
/Conv2D_bias_fused_bn_DequantizeLinear_Output_vaip_ 18
/Conv2D_bias_fused_bn_DequantizeLinear_Output_vaip_ 17
/Conv/Conv2D_weights_fused_bn_ DequantizeLinear":</w>
/Conv/Conv2D_bias_fused_bn_ DequantizeLinear":</w>
/ add:0_vaip_
)_opt "]},</w>
)_fix_ ":</w>
"t rans
"subgraph_(/cond_resblk 3_2/
"subgraph_(/cond_resblk 2_2/
"subgraph_( gen/TwoFrameArchai0f185/Conv_1
"subgraph_( Detector/ResBlock_1
"p erm":</w>
"onnx::Conv_5 4
"onnx::ConvTranspose_ 56
"onnx::ConvTranspose_ 55
"onnx::ConvTranspose_ 53
"onnx::ConvTranspose_ 51
"onnx::ConvTranspose_ 49
"onnx::Add_ 54
"onnx::Add_ 53
"onnx::Add_ 52
"onnx::Add_ 51
"onnx::Add_ 47
"onnx::Add_ 46
"onnx::Add_ 44
"onnx::Add_ 424_
"onnx::Add_ 40
"onnx::Add_ 39
"onnx::Add_ 37
"onnx::Add_ 35
"onnx::Add_ 34
"onnx::Add_ 32
"onnx::Add_ 312_
"onnx::Add_ 29
"onnx::Add_ 27
"input. 80_
"input. 68_
"input. 5
"input. 4
"input. 24_
"input. 24
"input. 224_
"input. 20
"input. 19
"input. 16
"input. 15
"input. 13
"input. 12_
"input. 12
"input. 112_
"input. 10
"compress_v1/Conv2d_13_pointwiseANDConv/Conv_ 3/
"compress_v1/Conv2d_13_pointwiseANDConv/Conv_ 2/
"compress_v1/Conv2d_ 9_pointwiseANDConv2d_10_pointwise/Conv/
"Transpose ",</w>
"2 8
"(resnet_enc.resblk 1
"(c onst_fold_opt__7
"(3 1
"(/resnet_enc/conv1/ops/ops.1/ Constant_1_output_0_DequantizeLinear_Output/duplicated_token_1
"(/cond_resblk1_1/conv1/ops/ops.0/ Constant_output_0_DequantizeLinear_Output/duplicated_token_
"(/cond_resblk1_1/conv1/ops/ops.0/ Constant_1_output_0_DequantizeLinear_Output/duplicated_token_1
"( backbone.decoder.fc
" encodings_
{"/cond_resblk 1_1
["gen/TwoFrameArchai0f185/Conv_ 2
[ 49
[49 152,</w>
[ 4
Gemm ",</w>
B ":</w>
:0_ QuantizeLinear_Input
8 1)",</w>
7 )"]},</w>
5/ BatchNorm/FusedBatchNormV3:0_vaip_
4 7)",</w>
3_ quantized":</w>
3_ quantized",</w>
39 )":</w>
36 0,</w>
3/ BiasAdd:0_vaip_
24 0],</w>
2/Conv _output_0",</w>
2/Conv ",</w>
1_ quantized",</w>
1_ DequantizeLinear_Output",</w>
14 6
12 ",</w>
/refiner/conv_tail /Conv
)(TransferMatMulToConv2d )_inserted_fix_
"trans B":</w>
"compress_v1/Conv2d_13_pointwiseANDConv /Conv_1/
"compress_v1/Conv2d_13_pointwiseANDConv /Conv/
"(compress_v1/Conv2d_ 12_pointwiseANDConv2d_13
"(/cond_resblk2_2/norm2/Constant_1_output_0_DequantizeLinear_Output/duplicated_token_ 8
"( 2
"( /refiner/
" Gemm",</w>
{"/cond_resblk 4_1
{"/cond_resblk 3_1
{"/cond_resblk 2_1
{" ConvTranspose_1
output_transpose_ DequantizeLinear
norm2/Constant_output_0_ DequantizeLinear_Output",</w>
norm2/Constant_1_output_0_ DequantizeLinear_Output"],</w>
et a":</w>
c_ey e_
b eta":</w>
_transpose_ DequantizeLinear
_ face
[15 7
[157 28
[15728 64,</w>
["/cond_resblk 4_1
["/cond_resblk 3_1
["/cond_resblk 2_1
[ 26
[ 1
DequantizeLinear_Output_vaip_4 8
Concat ",</w>
9_ DequantizeLinear_Output_vaip_3
9 /BatchNorm/FusedBatchNormV3:0_vaip_
8_ quantized":</w>
8 /BatchNorm/FusedBatchNormV3:0_vaip_
7 /BatchNorm/FusedBatchNormV3:0_vaip_
6 /BatchNorm/FusedBatchNormV3:0_vaip_
4_ quantized":</w>
4_ quantized",</w>
4/ BatchNorm/FusedBatchNormV3:0_vaip_
37 _vaip_6
3/ BatchNorm/FusedBatchNormV3:0_vaip_
3 1_vaip_
2_vaip_ 12
26 3)",</w>
23 _vaip_25
2/ops/ops.1/Tan h
2/ops/ops. 0/Gemm_output_0)(TransferMatMulToConv2d)",</w>
1_ QuantizeLinear":</w>
13 _vaip_4
1/ BatchNorm/FusedBatchNormV3:0_vaip_
0_vaip_ 24
0 0_vaip_24
/conv1/ops/ops. 1/LeakyRelu":</w>
/conv/ops/ops. 0/InstanceNormalization_output_0_vaip_
/Relu:0_ zero_point":</w>
/Relu:0_ scale":</w>
/Relu:0_ QuantizeLinear_Output",</w>
/Relu:0_ QuantizeLinear",</w>
/Relu:0_ DequantizeLinear_Output",</w>
/Relu:0_ DequantizeLinear",</w>
/Conv_1/Conv2D_weights_fused_bn_ DequantizeLinear":</w>
/Conv_1/Conv2D_bias_fused_bn_ DequantizeLinear":</w>
/Conv_1 /Conv2D":</w>
/Conv2D_ _1
/Conv /Conv2D":</w>
)_switch_inputs_order ",</w>
"subgraph_(/resnet_enc/resblk 6
"subgraph_( /
"input. 180_
"gen/TwoFrameArchai0f185/Conv_2 2
"gen/TwoFrameArchai0f185/Conv_2 1
"gen/TwoFrameArchai0f185/Conv_1 3
"gen/TwoFrameArchai0f185/Conv_1 2
"gen/TwoFrameArchai0f185/Conv_1 1
"gen/TwoFrameArchai0f185/Conv_1 0
"gen/TwoFrameArchai0f185/Conv_ 3
"gen/TwoFrameArchai0f185/Conv_ 20
"Detector/ResBlock_2/Conv _1
"Detector/ResBlock_11/Conv _1
"Detector/ResBlock_1 5/Conv_1
"Detector/DarkDownsample_ 5/Conv_1
"Detector/Conv 12
"Conv_ 8
"(mobilenet_v1/MobilenetV1/Conv2d_ 3
"(mobilenet_v1/MobilenetV1/Conv2d_ 2
"(mobilenet_v1/MobilenetV1/Conv2d_ 1
"(cond_resblk 4_1
"(cond_resblk 3_1
"(cond_resblk 2_1
"(cond_resblk 1_1
"(compress_v1/Conv2d_ 8_pointwiseANDConv2d_9
"(compress_v1/Conv2d_ 7_pointwiseANDConv2d_8
"(compress_v1/Conv2d_ 6_pointwiseANDConv2d_7
"(compress_v1/Conv2d_ 5_pointwiseANDConv2d_6
"(compress_v1/Conv2d_ 4_pointwiseANDConv2d_5
"(compress_v1/Conv2d_ 11_pointwiseANDConv2d_12
"(compress_v1/Conv2d_ 10_pointwiseANDConv2d_11
"(c amlkdetect_fc
"(alig_resblk3 .
"(alig_resblk 2.
"(/cond_resblk2_2/norm2/Constant_output_0_DequantizeLinear_Output/duplicated_token_ 6
"( refiner.conv
"( prediction_fc
"( encodings_fc
"( conv_out
"( blinkdetect_fc
"( Detector/DarkDownsample_1
" beta":</w>
{"gen/TwoFrameArchai0f185/Conv_ 2
pred_labels_ QuantizeLinear_Input
[ 512,</w>
Resize__1 21
PostProcess/stage0/x1/ seg
PostProcess/stage0/x0.5/ seg
LeakyRelu _output_0",</w>
BiasAdd :0"]},</w>
8_ quantized",</w>
7 7)",</w>
6 5)",</w>
51 )":</w>
5 53
4_pointwise/Conv2D_a/ biases:0_
37 _vaip_
2/ops/ops. 0/Gemm_output_0)(TransferMatMulToConv2d
2 8)",</w>
1/ add:0_
0_ quantized":</w>
0_ quantized",</w>
/Conv2D_bias_fused_bn_DequantizeLinear_Output_vaip_ 16
"(compress_v1/Conv2d_13_pointwiseANDConv/Conv_ 2/
"(compress_v1/Conv2d_13_pointwiseANDConv /Conv_1/
"(compress_v1/Conv2d_13_pointwiseANDConv /Conv/
"(compress_v1/Conv2d_ 9_pointwiseANDConv2d_10_pointwise/Conv/
"(Detector/Conv 18
"(Detector/Conv 14
} }</w>
{" /refiner/rep_conv
weights:0_ DequantizeLinear_Output_vaip_16
weights:0_ DequantizeLinear":</w>
v e
ve Reshape
t ":</w>
rep_conv /Conv
r g
rg b
rgb m
o veReshape
norm ed_
normed_ rgbm
mobilenet_v1/MobilenetV1_1/Conv2d_4_pointwise/Conv2D_a/ BiasAdd
m age
info_ dic
info_dic t":</w>
i mage
gen/TwoFrameArchai0f185/ add:0_
biases:0_ DequantizeLinear_Output_vaip_16
ax Pool
_pointwise/Conv/weights:0_ DequantizeLinear":</w>
_pointwise/Conv/biases:0_ DequantizeLinear_Output_vaip_14
_pointwise/Conv/biases:0_ DequantizeLinear":</w>
_pointwise/Conv/Relu:0_ zero_point"]},</w>
_pointwise/Conv/Relu:0_ scale",</w>
_pointwise/Conv/Relu:0_ QuantizeLinear":</w>
_pointwise/Conv/Relu:0_ DequantizeLinear":</w>
_pointwise/Conv/ Relu":</w>
_pointwise/Conv/ BiasAdd":</w>
["Detector/ResBlock_ 8
["Detector/ResBlock_ 6
[" 23
[" /refiner/rep_conv
[ 4],</w>
[ 384,</w>
[ 16],</w>
M oveReshape
M axPool
DequantizeLinear_Output_vaip_5 2
DequantizeLinear_Output_vaip_3 9
DequantizeLinear_Output )(
DequantizeLinear_Output)( MoveReshape
BiasAdd_raw_output___5 :0_vaip_10
BiasAdd_raw_output___4 :0_vaip_
9_ DequantizeLinear_Output_vaip_29
9 )_download_0",</w>
8 )(bias)",</w>
7_ DequantizeLinear_Output_vaip_32
7_ DequantizeLinear_Output_vaip_30
7_ DequantizeLinear_Output_vaip_28
58 )":</w>
5 17
4_ DequantizeLinear_Output_vaip_32
4_ DequantizeLinear_Output_vaip_28
34 3_vaip_
32 8_vaip_
3 0)":</w>
3 )(bias)",</w>
2_ DequantizeLinear_Output_vaip_3
24 8)",</w>
2/ops/ops.1/Sigmoid_output_0_ DequantizeLinear_Output)(MoveReshape
2.ops.0.bias_ DequantizeLinear_Output_vaip_4
12 8)",</w>
10 8)",</w>
1.ops.0.bias_ DequantizeLinear_Output_vaip_4
0/Gemm ":</w>
0/ add:0_
/resnet_enc/conv2/ops/ops. 0/Conv_output_0_
/Conv2D_weights_fused_bn_DequantizeLinear_Output_vaip_ 19
/Conv2D_bias_fused_bn_DequantizeLinear_Output_vaip_ 19
)_inserted_ fix
"subgraph_(onnx::Clip_6 7
"subgraph_(onnx::Clip_ 64
"subgraph_(onnx::Clip_ 58
"subgraph_(/cond_resblk 4_2/
"subgraph_( Detector/ResBlock_
"subgraph_( Detector/DarkDownsample_
"subgraph_( ConvTranspose_1
"refiner.rep_conv 4.rep_conv
"refiner.rep_conv 3.rep_conv
"refiner.rep_conv 2.
"refiner.rep_conv 1.
"refiner.conv _tail
"refiner.conv _head
"onnx::Conv_6 80_
"onnx::Conv_6 62_
"onnx::Conv_6 24_
"onnx::Conv_6 18_
"onnx::Conv_6 12_
"layers_up. 8.0.weight_
"layers_up. 8.0.bias_
"layers_up. 6.0.weight_
"layers_up. 4.0.weight_
"layers_up. 2.0.weight_
"layers_up. 0.0.weight_
"input_ face
"e 3_transpose_
"alig_resblk3 .conv
"alig_resblk1.conv 2.ops.
"alig_resblk 2.conv
"Conv_1 0
"ConvTranspose_1 86_bias_4bn_
"ConvTranspose_1 80_bias_4bn_
"ConvTranspose_1 71_bias_4bn_
"ConvTranspose_1 62_bias_4bn_
"Clip_ 15
"Clip_ 14
"Clip_ 13
"Clip_ 12
"Clip_ 10
"2 6
"/ encodings_fc
"(onnx::Conv_ 47
"(onnx::Conv_ 42
"(onnx::Conv_ 39
"(onnx::Conv_ 38
"(onnx::Conv_ 29
"(onnx::Conv_ 27
"(onnx::Clip_64 3_vaip_
"(onnx::Clip_6 16_vaip_4
"(onnx::Clip_58 9_vaip_
"(onnx::Clip_57 4_vaip_
"(mobilenet_v1/MobilenetV1/Conv2d_ 0/
"( encodings_QuantizeLinear_Input
" }
" resnet_enc
" backbone.c
" ]
" PostProcess/stage0/x1/Sigmoid
" PostProcess/stage0/x0.5/Sigmoid
" Detector/logitsFlatP/
{"Detector/ResBlock_1 7
{"Detector/ResBlock_ 8
{"Detector/ResBlock_ 6
{"/cond_resblk 4_2
{"/cond_resblk 3_2
{"/cond_resblk 2_2
own load",</w>
gate/ops/ops. 1/LeakyRelu_output_0_vaip_
flo at
float ",</w>
fix 2
fix2 float",</w>
conv 2d-fix",</w>
[6 553
[6553 6,</w>
["Detector/ResBlock_1 7
["/cond_resblk 4_2
["/cond_resblk 3_2
["/cond_resblk 2_2
["( alig_resblk
[" gen/TwoFrameArchai0f185/Conv
[ 229
[229 37
T 32
O A
OA T32
L OAT32
InstanceNormalization _output_0_
F LOAT32
Detector/logitsP :0_QuantizeLinear_Input
DequantizeLinear_Output/duplicated_vaip_ 49
DequantizeLinear_Output/duplicated_vaip_ 4
D2S_1/DepthToSpace _output_0_
BiasAdd :0
Add_ 1_output_0_
8 8,</w>
8 0,</w>
7_ QuantizeLinear_Output",</w>
7_ QuantizeLinear",</w>
5/ add:0_
5 2)",</w>
4_ depthwise/biases:0_
4_ QuantizeLinear_Output",</w>
4_ QuantizeLinear",</w>
48 )":</w>
4/ add:0_
4/ act/LeakyRelu_output_0_
4 .weight_
4 )"]},</w>
3_vaip_ 24
3_ depthwise/biases:0_
3_ QuantizeLinear_Output",</w>
3_ QuantizeLinear",</w>
3/ add:0_
3/ act/LeakyRelu_output_0_
3 3)":</w>
3 .weight_
2_ depthwise/biases:0_
2_ QuantizeLinear_Output",</w>
2_ QuantizeLinear",</w>
24 )":</w>
2/ops/ops.1/Tanh _output_0_
2/ add:0_
2/ act/LeakyRelu_output_0_
2 :0_vaip_
2 16)",</w>
1_vaip_ 18
1_ depthwise/biases:0_
19 _vaip_
16 7_vaip_
15 8)",</w>
15 0)",</w>
12 3)",</w>
1/ act/LeakyRelu_output_0_
1. conv
1 2/Relu:0_
1 19
/up_blk/up_ 2/
/up_blk/up_ 1/
/up_blk /up/
/resnet_enc/conv2/ops/ops. 0/Conv_output_0_vaip_
/resnet_enc/conv1/ops/ops.2/ LeakyRelu_output_0_
/resnet_enc/conv1/ops/ops.1/ Constant_1_output_0_DequantizeLinear_Output/duplicated_token_1
/resnet_enc/conv1/ops/ops. 0/Conv_output_0_
/refiner/conv_tail/Conv _output_0_
/conv_out2/ops/ops. 0/Conv_output_0_
/Conv_1/Conv2D_weights_fused_bn_ DequantizeLinear_Output_vaip_2
/Conv2D__1 0
/Conv2D_ _8
.conv2.ops. 0.weight_
.conv 1.ops.0.weight_
- conv2d-fix",</w>
)_inserted_fix _1
"e 2_transpose_
"e 1_transpose_
"d ownload",</w>
"/up_blk /up/
"(/resnet_enc/resblk5 a/conv2/ops/ops.0/Constant_output_0_DequantizeLinear_Output/duplicated_token_
"(/resnet_enc/resblk4 a/conv2/ops/ops.0/Constant_output_0_DequantizeLinear_Output/duplicated_token_
"(/resnet_enc/resblk4 a/conv2/ops/ops.0/Constant_1_output_0_DequantizeLinear_Output/duplicated_token_
"(/resnet_enc/resblk3 a/conv2/ops/ops.0/Constant_output_0_DequantizeLinear_Output/duplicated_token_
"(/resnet_enc/resblk3 a/conv2/ops/ops.0/Constant_1_output_0_DequantizeLinear_Output/duplicated_token_
